---
type: StructuralSectionConcreteRectangle
namespace: Autodesk.Revit.DB.Structure.StructuralSections
version: 2024
members: 1
tags: [revit-api, class]
---

# StructuralSectionConcreteRectangle

`Autodesk.Revit.DB.Structure.StructuralSections.StructuralSectionConcreteRectangle` · Revit 2024 · 1 members

| Kind | Member | Since | Signature |
| --- | --- | --- | --- |
| Constructor | StructuralSectionConcreteRectangle | 2016 | `public StructuralSectionConcreteRectangle ( double width , double height , double centroidHorizontal , double centroidVertical , double principalAxesAngle , double sectionArea , double perimeter , double nominalWeight , ` |